Public Member Functions | Friends | List of all members
ACAPI::UI::Menu::MenuItem Class Reference
Menu integration
MenuItem is a representation of one of this addon's menu item. More...
#include <MenuItem.hpp>
 Inheritance diagram for ACAPI::UI::Menu::MenuItem:
 Public Member Functions
GS::UniString  | GetText () const
The text of the menu item.
void  | SetText (const GS::UniString &text)
Changes the text of the menu item.
GS::UniString  | GetWorkEnvironmentText () const
The text of the menu item, which appears in the Work Environment Dialog.
void  | SetWorkEnvironmentText (const GS::UniString &text)
Changes the text of the menu item, which will appear in the Work Environment Dialog.
GSFlags  | GetFlags () const
The flags of the menu item command.
void  | SetFlags (const GSFlags flags)
Changes the flags of the menu item command.
std::vector< GS::UniString >  | GetShortcuts () const
The shortcuts of the menu item command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | MenuManager
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
MenuItem is a representation of one of this addon's menu item.
Example code snippets from DG_Test / Dump information about this menucommand
 API_MenuItemRef itemRef;
 itemRef.menuResID = DGTEST_MENU_STRINGSID;
 itemRef.itemIndex = 21;
 auto menuItem = ACAPI::UI::Menu::CreateMenuManager ().GetMenuItem (itemRef);
 if (menuItem.IsErr ()) {
 ACAPI_WriteReport ("Failed to get Menu Item.", false);
 return;
 }
 ACAPI_WriteReport (GS::UniString::Printf ("Current menuCommand's text: %T", menuItem->GetText ().ToPrintf ()), false);
 ACAPI_WriteReport (GS::UniString::Printf ("Current menuCommand's work environment text: %T", menuItem->GetWorkEnvironmentText ().ToPrintf ()), false);
 ACAPI_WriteReport (GS::UniString::Printf ("Current menuCommand's flags: %d", menuItem->GetFlags ()), false);
 std::vector<GS::UniString> shortcuts = menuItem->GetShortcuts ();
 GS::UniString shortcutsString;
 for (int index = 0; index < shortcuts.size (); ++index) {
 shortcutsString += shortcuts[index];
 if (index < shortcuts.size () - 1) {
 shortcutsString += ", ";
 }
 }
 ACAPI_WriteReport (GS::UniString::Printf ("Current menuCommand's shortcuts: %T", shortcutsString.ToPrintf ()), false);
Since
Archicad 29
Member Function Documentation
◆ GetFlags()
 GSFlags ACAPI::UI::Menu::MenuItem::GetFlags  |  ( |   | ) |   const
The flags of the menu item command.
Returns
The flags of the menu item command.
◆ GetShortcuts()
 std::vector< GS::UniString > ACAPI::UI::Menu::MenuItem::GetShortcuts  |  ( |   | ) |   const
The shortcuts of the menu item command.
Returns
The shortcuts of the menu item command.
◆ GetText()
 GS::UniString ACAPI::UI::Menu::MenuItem::GetText  |  ( |   | ) |   const
The text of the menu item.
Returns
Menu item text.
◆ GetWorkEnvironmentText()
 GS::UniString ACAPI::UI::Menu::MenuItem::GetWorkEnvironmentText  |  ( |   | ) |   const
The text of the menu item, which appears in the Work Environment Dialog.
Returns
The text that appears as the name of the menu item in the menu customization part of the work environment dialog.
◆ SetFlags()
 void ACAPI::UI::Menu::MenuItem::SetFlags  |  ( |  const GSFlags |  flags | )
Changes the flags of the menu item command.
Parameters
flags | The desired flags of the menu item command.
◆ SetText()
 void ACAPI::UI::Menu::MenuItem::SetText  |  ( |  const GS::UniString & |  text | )
Changes the text of the menu item.
Parameters
text | Menu item text to set.
◆ SetWorkEnvironmentText()
 void ACAPI::UI::Menu::MenuItem::SetWorkEnvironmentText  |  ( |  const GS::UniString & |  text | )
Changes the text of the menu item, which will appear in the Work Environment Dialog.
Parameters
text | The text that will appear as the name of the menu item in the menu customization part of the work environment dialog.
Example code snippets from DG_Test / Change the WE text of the Dump Info menucommand
 API_MenuItemRef itemRef;
 itemRef.menuResID = DGTEST_MENU_STRINGSID;
 itemRef.itemIndex = 21;
 auto menuItem = ACAPI::UI::Menu::CreateMenuManager ().GetMenuItem (itemRef);
 if (menuItem.IsErr ()) {
 ACAPI_WriteReport ("Failed to get Menu Item.", false);
 return;
 }
 menuItem->SetWorkEnvironmentText (GS::UniString::Printf ("CHANGED %T", menuItem->GetText ().ToPrintf ()));